#include "WDG.h"


/**************************************************************************
函数功能：初始化独立看门狗
入口参数：prer：分频数、rlr：重装载寄存器值
返回  值：无
注意事项：1、分频数只有低3位有效（0~7）  2、重装载值低11位有效
          3、分频因子 = 4*2^prer，但最大值只能是256!
          时间计算(大概)：TimeOut = ((4*2^prer)*rlr)/40 (ms)
**************************************************************************/
void IWDG_Init(u8 prer,u16 rlr) 
{   
    IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);   //使能对寄存器IWDG_PR和IWDG_RLR的写操作
    IWDG_SetPrescaler(prer);                        //设置IWDG预分频值:设置IWDG预分频值为64
    IWDG_SetReload(rlr);                            //设置IWDG重装载值
    IWDG_ReloadCounter();                           //按照IWDG重装载寄存器的值重装载IWDG计数器
    IWDG_Enable();                                  //使能IWDG
}


/**************************************************************************
函数功能：喂独立看门狗
入口参数：无
返回  值：无
注意事项：无
**************************************************************************/
void IWDG_Feed(void)
{   
    IWDG_ReloadCounter();                           //重装载寄存器
}


