#include "sys.h"

/**************************************************************************
函数功能：计算线程已使用的栈大小
入口参数：thread：线程控制块指针
返回  值：线程已使用的栈大小
注意事项：rt_kprintf("Stack:%d Byte\n",CheckStackUsage(UsartRece_thread));
**************************************************************************/
u16 CheckStackUsage(rt_thread_t thread)
{
    u8 *stack_start = (u8 *)thread->stack_addr;             //线程栈基地址
    u8 *stack_end = stack_start + thread->stack_size;       //线程栈实际起始增长地址
    u8 *stack_pointer = (u8 *)thread->sp;                   //栈顶地址

    return stack_end - stack_pointer;                       //返回已使用的栈大小
}


/**************************************************************************
函数功能：设置中断向量表偏移地址
入口参数：baseaddr: 基址、offset: 偏移量(必须是0, 或者0X100的倍数)
返回  值：无
注意事项：设置NVIC的向量表偏移寄存器,VTOR低9位保留,即[8:0]保留
**************************************************************************/
void sys_nvic_set_vector_table(uint32_t baseaddr, uint32_t offset)
{
    SCB->VTOR = baseaddr | (offset & (uint32_t)0xFFFFFE00);
}

/**************************************************************************
函数功能：执行: WFI指令
入口参数：无
返回  值：无
注意事项：执行完该指令进入低功耗状态, 等待中断唤醒
**************************************************************************/
void sys_wfi_set(void)
{
    __ASM volatile("wfi");
}

/**************************************************************************
函数功能：关闭所有中断
入口参数：无
返回  值：无
注意事项：不包括fault和NMI中断
**************************************************************************/
void sys_intx_disable(void)
{
    __ASM volatile("cpsid i");
}

/**************************************************************************
函数功能：开启所有中断
入口参数：无
返回  值：无
注意事项：不包括fault和NMI中断
**************************************************************************/
void sys_intx_enable(void)
{
    __ASM volatile("cpsie i");
}

/**************************************************************************
函数功能：设置栈顶地址
入口参数：addr: 栈顶地址
返回  值：无
注意事项：无
**************************************************************************/
void sys_msr_msp(uint32_t addr)
{
    __set_MSP(addr);
}

/**************************************************************************
函数功能：系统软复位
入口参数：无
返回  值：无
注意事项：无
**************************************************************************/
void sys_soft_reset(void)
{
    NVIC_SystemReset();
}
